tutor/app/controllers/tracks_controller.rb

  def show
  	id = params[:id]
    @topic = Topic.find_by_id(id)
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "1"]]

  def getProblems
  	id = params[:id]
  	track = Track.find(id)
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    t = Track.new(permitCreate)
  	if t.save
---
INSERT INTO "tracks" ("created_at", "difficulty", "title", "topic_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 27 Mar 2014 23:17:35 UTC +00:00], ["difficulty", 3], ["title", "7amada"], ["topic_id", 2], ["updated_at", Thu, 27 Mar 2014 23:17:35 UTC +00:00]]